src/Catalogs/Сервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Сервера</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПортСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСервера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСерверов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыСерверов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыСерверов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сервер1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерверSQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХранилищеКонфигураций</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Сервера/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ЭтотОбъект.ТипСервера = Перечисления.ТипыСерверов.Сервер1С Тогда 
		ПараметрыПодключения = ЗадачиНаСервере.ПолучитьПараметрыИзСтрокиПодключенияКСерверу(ЭтотОбъект.Наименование);
		ЭтотОбъект.Наименование = ПараметрыПодключения.ИмяСервера;
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ПортКластера) Тогда
			ЭтотОбъект.ПортКластера = ПараметрыПодключения.ПортКластера;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ПортСервера) Тогда
			ЭтотОбъект.ПортСервера = ПараметрыПодключения.ПортСервера;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПортСервераАдминистрирования) Тогда
		ЭтотОбъект.ПортСервераАдминистрирования = 1545;
	КонецЕсли;
КонецПроцедуры
